In [1]:
import pandas as pd

In [2]:
dict1 = {'Name' : ['Priyang', 'Aadhya', 'Krishna','Vedant','Parshv',
                   'Mittal', 'Swarali'],
         'Marks' : [98,89,87,99,90,83,99],
         'Gender' : ['Male','Female','Female','Male','Male',
                     'Female','Female']
        }

df1 = pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2  Krishna     87  Female
3   Vedant     99    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Swarali     99  Female

In [6]:
df1.isnull().sum(axis=1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [7]:
df1.isnull().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

In [8]:
df1.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [9]:
df1.describe(include='all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

In [11]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

In [12]:
df1['Gender'].nunique()

2

In [13]:
df1['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

In [16]:
df1[df1['Marks']>=90]

      Name  Marks  Gender
0  Priyang     98    Male
3   Vedant     99    Male
4   Parshv     90    Male
6  Swarali     99  Female

In [19]:
len(df1[(df1['Marks']>=90) &( df1['Marks']<=100)])

4

In [21]:
sum(df1['Marks'].between(90,100))

4

In [23]:
print(df1['Marks'].mean())

92.14285714285714

In [24]:
print(df1['Marks'].min())

83

In [25]:
print(df1['Marks'].max())

99